import 'package:flutter/material.dart';
import 'package:molham/utiltes/size/size_app.dart';
import 'package:siri_wave/siri_wave.dart';
import 'package:speech_to_text/speech_to_text.dart' as stt;
import 'package:flutter_tts/flutter_tts.dart';

import '../components/CricleImage.dart';

class VoiceApp extends StatefulWidget {
  @override
  _VoiceAppState createState() => _VoiceAppState();
}

enum TtsState { playing, stopped }

class _VoiceAppState extends State<VoiceApp> {
  late stt.SpeechToText _speech;
  FlutterTts flutterTts = FlutterTts();
  TtsState ttsState = TtsState.stopped;

  String _text = 'Press the button and speak';
  bool isListening = false;

  @override
  void initState() {
    super.initState();
    _speech = stt.SpeechToText();
  }

  Future<void> _speak(String text) async {
    await flutterTts.setLanguage('ar-EG'); // Set language to Arabic
    await flutterTts.setPitch(1);
    await flutterTts.speak(text);
  }

  Future<void> _listen() async {
    if (!_speech.isAvailable) {
      print('Listening not available');
      return;
    }

    bool available = await _speech.listen(
      onResult: (result) async {
        setState(() {
          _text = "Processing..."; // Update UI to indicate processing
        });

        String? response = generateResponse(result.recognizedWords);
        if (response != null) {

          await _speak(response);
        }

        setState(() {
          _text = result.recognizedWords; // Update UI with recognized text
        });
      },
      localeId: 'ar-EG', // Set locale to Arabic
    );

    if (!available) {
      print('Speech recognition not available');
    } else {
      setState(() {
        isListening = true;
      });
    }
  }

  Future<void> _stopListening() async {
    await _speech.stop();
    setState(() {
      isListening = false;
    });
  }

  String? generateResponse(String input) {
    input = input.toLowerCase();
    Map<String, String> basicResponses = {
    'اسمك ايه':' هاي اسمي مّلهم',
    "ما هي وظيفه الروبوت ملهم":"ملهم هو روبوت ذكاء اصطناعي مصمم لتقديم المساعدة والإجابة على أسئلة المستخدمين وتقديم المعلومات المفيدة.",
     " مٌلهم اتصنع ازاي؟":"تم تصميمي باستخدام تقنيات الذكاء الاصطناعي وتعلم الآلة وتقنيات الهاردوير وبرامج السوفر وير ",
    "مٌلهم انت اتصنعت ازاي":"تم تصميمي ملهم باستخدام تقنيات الذكاء الاصطناعي وتعلم الآلة وتقنيات الهاردوير وبرامج السوفر وير ",
    "ما هي اللغات البرمجية المستخدمة في تطوير الروبوت ملهم؟":"تم استخدام لغات وتقنيات متعدده لتطويري مثل python , flutter ",
    "ايه هي اللغات البرمجية المستخدمة في تطوير الروبوت ملهم؟":"تم استخدام لغات وتقنيات متعدده لتطويري مثل python , flutter",
    "ٌمُلهم اتطور ازاي":"تم استخدام لغات وتقنيات متعدده لتطويري مثل python , flutter",
    "هل هناك خطط لتحسين وتطوير الروبوت ملهم في المستقبل؟":"نعم، فريق التطوير يعمل باستمرار على تحسين وتطوير ملهم من خلال إضافة ميزات جديدة وتحسين أداء الذكاء الاصطناعي وتعزيز قدراته في التفاعل مع المستخدمين.",
    "هل مٌلهم سيتم تطويره ف المستقبل":"نعم، فريق التطوير يعمل باستمرار على تحسين وتطوير ملهم من خلال إضافة ميزات جديدة وتحسين أداء الذكاء الاصطناعي وتعزيز قدراته في التفاعل مع المستخدمين",
    "هل فريق ملهم سيقوم باي تغيرات عليه":"نعم، فريق التطوير يعمل باستمرار على تحسين وتطوير ملهم من خلال إضافة ميزات جديدة وتحسين أداء الذكاء الاصطناعي وتعزيز قدراته في التفاعل مع المستخدمين",
    "هل ملهم سيتغير في المستقبل ؟":"نعم، فريق التطوير يعمل باستمرار على تحسين وتطوير ملهم من خلال إضافة ميزات جديدة وتحسين أداء الذكاء الاصطناعي وتعزيز قدراته في التفاعل مع المستخدمين",
    "فريق ملهم مهتم بتغيره في المستقبل؟":"نعم، فريق التطوير يعمل باستمرار على تحسين وتطوير ملهم من خلال إضافة ميزات جديدة وتحسين أداء الذكاء الاصطناعي وتعزيز قدراته في التفاعل مع المستخدمين",
    " مالفائدة من مٌلهم":"ملهم يقدم المساعدة ويجاوب على الأسئلة بشكل عام. وأيضًا يساعد في تصحيح الامتحانات ويعمل كمساعد للدكتور خلال الامتحانات الشفوية",
    "مٌلهم انت فايدتك ايه":" مٌلهم يقدم المساعدة ويجاوب على الأسئلة بشكل عام. وأيضًا يساعد في تصحيح الامتحانات ويعمل كمساعد للدكتور خلال الامتحانات الشفويه",
    "بيعمل إيه مٌلهم في الامتحانات الشفوية؟":"مٌلهم بيسأل الطلاب في الامتحانات الشفوية وبيقوم بتصحيح إجاباتهم",
    "مٌلهم انت بتعمل ايه في الامتحانات الشفويه":"مٌلهم يسأل الطلاب في الامتحانات الشفوية وبيقوم بتصحيح إجاباتهم",
    "كيف تساعد اساتذه الجامعه يا مٌلهم":"مٌلهم يسأل الطلاب في الامتحانات الشفوية وبيقوم بتصحيح إجاباتهم",
    "من هو التيم ليدر المسؤل عن انشاء مٌلهم":"اهلا التيم ليدر المسؤل لانشائي هو احمد ياسر",

    "اسماء المطورين لمشروع مُلهم":"المصصمين لمشروع ملهم هم احمد ياسر , احمد حسين ,الاء خالد ,هاجر ,رضوي ,رنا,هدير ,رحاب ,محمد , احمد حافظ",
    "مطورين الروبوت مٌلهم":"احمد ياسر , احمد حسين ,الاء خالد ,هاجر ,رضوي ,رنا,هدير ,رحاب ,محمد , احمد حافظ",
    "مٌلهم ازيك":"الحمدلله وانت",
    "مٌلهم عامل ايه":"الحمدلله بخير وانت",
    "ازيك": "بخير شكرا لسؤالك" ,
    "مٌلهم":"نعم",
    "باي":"باي",
    "باي مٌلهم":"باي",
    "هل يمكنك مساعدتي":"نعم تفضل ",
    "من المسؤلين عن السوفت وير لانشائك":"احمد ياسر و رنا و رضوي ",
    "من قام بانشاء السوفتر وير لمٌلهم":"احمد ياسر و رنا و رضوي",
    "تيم السوفت وير مين":"احمد ياسر و رنا و رضوي",
    "مين تيم السوفت وير": "احمد ياسر و رنا و رضوي ",
    "مين عمل السوفت وير""احمد ياسر و رنا و رضوي:"
    "السوفت وير مين الي عمله":"احمد ياسر و رنا و رضوي",

    "من المسؤولين عن الهارد وير لانشائك":"احمد حافظ و محمد نعمان و رحاب ",
    "من قام بانشاء الهارد وير لمٌلهم":"احمد حافظ و محمد نعمان و رحاب",
    "تيم الهارد وير مين":"احمد حافظ و محمد نعمان و رحاب",
    "مين عمل الهارد وير":" احمد حافظ و محمد نعمان و رحاب",
    "الهارد وير مين العملوا":"احمد حافظ و محمد نعمان و رحاب",
    "ما هي وظيفة مُلهم؟":"مُلهم هو روبوت ذكاء اصطناعي مصمم لمساعدة الناس وتقديم المعلومات.",
    "مٌلهم وظيفته ايه":"مُلهم هو روبوت ذكاء اصطناعي مصمم لمساعدة الناس وتقديم المعلومات.",
    "مٌلهم بيعمل ايه ":"مُلهم هو روبوت ذكاء اصطناعي مصمم لمساعدة الناس وتقديم المعلومات.",
    "بيعمل ايه مٌلهم":"مُلهم هو روبوت ذكاء اصطناعي مصمم لمساعدة الناس وتقديم المعلومات.",
   " ما هي أبرز ميزة تميز مُلهم عن الروبوتات الأخرى؟":"أبرز ميزة تميز مُلهم هي قدرته على فهم اللغة البشرية بشكل طبيعي وتقديم الردود السليمة والمنطقية.",
       "ايه مميزاتك":"أبرز ميزة تميز مُلهم هي قدرته على فهم اللغة البشرية بشكل طبيعي وتقديم الردود السليمة والمنطقية",
    "ايه المميز في مٌلهم عن باقي الروبوتات":"أبرز ميزة تميز مُلهم هي قدرته على فهم اللغة البشرية بشكل طبيعي وتقديم الردود السليمة والمنطقيه",
    "هل يمكن استخدام مُلهم في التعليم؟":
    "نعم، يمكن استخدام مُلهم في التعليم لتقديم المساعدة وتوفير المعلومات للطلاب.",
    "ممكن استخدم مُلهم في التعليم؟":
    "نعم، يمكن استخدام مُلهم في التعليم لتقديم المساعدة وتوفير المعلومات للطلاب.",


      // اماكن

      "مكان قاعة واحد": "الدور الأرضي",
      "قاعة واحد فين": "الدور الأرضي",
      "فين قاعة واحد": "الدور الأرضي",
      "قاعة واحد ف الدور الكام": "الدور الأرضي",
      "مكان مدرج واحد": "الدور الأرضي",
      "مدرج واحد فين": "الدور الأرضي",
      "فين مدرج واحد": "الدور الأرضي",
      "مدرج واحد ف الدور الكام": "الدور الأرضي",
      "مكان قاعة اتنين": "الدور الأرضي",
      "قاعة اتنين فين": "الدور الأرضي",
      "فين قاعة اتنين": "الدور الأرضي",
      "قاعة اتنين ف الدور الكام": "الدور الأرضي",
      "مكان مكتب شئون الطلبة": "الدور الأرضي",
      "مكتب مكتب شئون الطلبة فين": "الدور الأرضي",
      "فين مكتب شئون الطلبة": "الدور الأرضي",
      "مكتب شئون الطلبة ف الدور الكام": "الدور الأرضي",
      "مكان معمل واحد": "الدور الأول",
      "معمل واحد فين": "الدور الأول",
      "فين معمل واحد": "الدور الأول",
      "معمل واحد ف الدور الكام": "الدور الأول",
      "مكان قاعة تلاتة": "الدور الأول",
      "قاعة تلاتة فين": "الدور الأول",
      "فين قاعة تلاتة": "الدور الأول",
      "قاعة تلاتة ف الدور الكام": "الدور الأول",
      "مكان معمل اتنين": "الدور الأول",
      "معمل اتنين فين": "الدور الأول",
      "فين معمل اتنين": "الدور الأول",
      "معمل اتنين ف الدور الكام": "الدور الأول",
      "مكان قاعة السيمينار": "الدور الأول",
      "قاعة السيمينار فين": "الدور الأول",
      "فين قاعة السيمينار": "الدور الأول",
      "قاعة السيمينار ف الدور الكام": "الدور الأول",
      "مكان معمل ايه": "الدور الأول",
      "معمل ايه فين": "الدور الأول",
      "فين معمل ايه": "الدور الأول",
      "معمل ايه في الدور الكام": "الدور الأول",
      "مكان مكتب الأستاذ الدكتورأحمدالعشري": "الدور الأول",
      "مكتب الأستاذالدكتور أحمدالعشري فين": "الدور الأول",
      "فين مكتب الأستاذ الدكتور أحمد العشري": "الدور الأول",
      "مكتب الأستاذ الدكتور أحمد العشري ف الدور الكام": "الدور الأول",
      "مكان مكتب عميد الكلية: الأستاذ الدكتور أسامة أبو سعدة": "الدور الأول",
      "مكتب عميد الكلية: الأستاذ الدكتور أسامة أبو سعدة فين": "الدور الأول",
      "فين مكتب عميد الكلية: الأستاذ الدكتور أسامة أبو سعدة": "الدور الأول",
      "مكتب عميد الكلية: الأستاذ الدكتور أسامة أبو سعدة ف الدور الكام": "الدور الأول",
      "مكان معمل اربعة": "الدور التاني",
      "معمل اربعة فين": "الدور التاني",
      "فين معمل اربعة": "الدور التاني",
      "معمل اربعة ف الدور الكام": "الدور التاني",
      "مكان معمل تلاتة": "الدور التاني",
      "معمل تلاتة فين": "الدور التاني",
      "فين معمل تلاتة": "الدور التاني",
      "معمل تلاتة ف الدور الكام": "الدور التاني",
      "مكان مدرج اتنين": "الدور التاني",
      "مدرج اتنين فين": "الدور التاني",
      "فين مدرج اتنين": "الدور التاني",
      "مدرج اتنين ف الدور الكام": "الدور التاني",
      "مكان معمل بي": "الدور التاني",
      "معمل بي فين": "الدور التاني",
      "فين معمل بي": "الدور التاني",
      "مكان معمل سبعة": "الدور الرابع",
      "معمل سبعة فين": "الدور الرابع",
      "فين معمل سبعة": "الدور الرابع",
      "معمل سبعة ف الدور الكام": "الدور الرابع",
      "مكان معمل تمانية": "الدور الرابع",
      "معمل تمانية فين": "الدور الرابع",
      "فين معمل تمانية": "الدور الرابع",
      "معمل تمانية ف الدور الكام": "الدور الرابع",
      "مكان معمل دي": "الدور الرابع",
      "معمل دي فين": "الدور الرابع",
      "فين معمل دي": "الدور الرابع",
      "معمل دي ف الدور الكام": "الدور الرابع",
      "مكان مكتب معيدين قسم نظم المعلومات": "الدور الرابع",
      "مكتب معيدين قسم نظم المعلومات فين": "الدور الرابع",
      "فين مكتب معيدين قسم نظم المعلومات": "الدور الرابع",
      "مكتب معيدين قسم نظم المعلومات ف الدور الكام": "الدور الرابع",
      "مكان معمل خمسة": "الدور التالت",
      "معمل خمسة فين": "الدور التالت",
      "فين معمل خمسة": "الدور التالت",
      "معمل خمسة ف الدور الكام": "الدور التالت",
      "مكان معمل ستة": "الدور التالت",
      "معمل ستة فين": "الدور التالت",
      "فين معمل ستة": "الدور التالت",
      "معمل ستة ف الدور الكام": "الدور التالت",
      "مكان مدرج تلاتة": "الدور التالت",
      "مدرج تلاتة فين": "الدور التالت",
      "فين مدرج تلاتة": "الدور التالت",
      "مدرج تلاتة ف الدور الكام": "الدور التالت",
      "مكان معمل سي": "الدور التالت",
      "معمل سي فين": "الدور التالت",
      "فين معمل سي": "الدور التالت",
      "معمل سي ف الدور الكام": "الدور التالت",
      "مكان مكتب معيدين قسم تكنولوجيا المعلومات": "الدور التالت",
      "مكتب معيدين قسم تكنولوجيا المعلومات فين": "الدور التالت",
      "فين مكتب معيدين قسم تكنولوجيا المعلومات": "الدور التالت",
      "مكتب معيدين قسم تكنولوجيا المعلومات ف الدور الكام": "الدور التالت",
      "مكان دكتور مي رمضان": "الدور التالت",
      "مكتب دكتور مي رمضان فين": "الدور التالت",
      "فين مكتب دكتور مي رمضان": "الدور التالت",
      "مكتب دكتور مي رمضان في الدور الكام": "الدور التالت",



        "ايه البرمجه": "البرمجة ببساطة إنك تلعب بعقلك علشان تخلي الكمبيوتر يعمل حاجات مفيدة",
        "ازاي أبدا البرمجه": "تبدأ بتعلم الأساسيات زي الْمَفَاهِيم الْأَسَاسِيَّة والسنتاكس للغة اللي عايز تبرمج بيها",
        "الفرق بين البرمجه والتصميم": "البرمجة هي كتابة الكود اللي يعمل برنامج معين، بينما التصميم هو تصميم شكل البرنامج وواجهته",
        "لازم خبره ولا ممكن ابدا من الصفر": "تقدر تتعلم من الصفر بس لازم تكون متحمس وعندك شوية صبر",
        "ازاي اختار اللغه المناسبه لمشروعي": "تختار اللغة اللي تناسب نوع المشروع واللي تعرفها أو تحب تتعلمها",
        "اهم اللغات البرمجيه المستخدمه دلوقتي ": " فيه كتير زي جافا وجافا سكربت و بايثون",
        "الباج في البرمجه دوره اي": "الباج دوره يا جدعان إنه الأخطاء اللي بتحصل في البرمجة وبيحتاج لتصحيحها",
        "ازاي اتعلم برمجه بدون دورات مكلفه": "تقدر تستخدم الموارد المجانية على الإنترنت زي اليوتيوب والمدونات والمواقع التعليمية ",
        "هل برمجه الألعاب اختصاص صعب": "مش صعب بس  هياخد  وقت ومجهود",
        "الفرق بين تطوير المواقع وتطوير التطبيقات": "تطوير المواقع بيكون للويب، بينما تطوير التطبيقات بيكون للهواتف الذكية",
        "ما هو الفرق بين تطوير الويب وتطوير تطبيقات المحمول": "تَطْوِيْرُ الْوِيْبِ بَيْخَتَصُّ بِبِنَاءِ تَطْبِيقَاتٍ تَعْمَلُ عَلَى الْمُتَصَفِّحِ، بَيْنَمَا تَطْوِيْرُ تَطْبِيْقَاتٍ يَشْمَلُ بِنَاءَ تَطْبِيقَاتٍ تَعْمَلُ عَلَى أَنْظِمَةِ التَّشْغِيْلِ الْمُحَمَّلَةِ",
        "الالجورزم دوره في البرمجه إيه": "دوره هو الخطوات اللي بتبعها البرنامج علشان يحل مشكلة معينة",
        "البرمجه الشيئيه دورها ايه": "دورها إنك تنظم الكود بشكل منظم وسهل التعديل والتطوير  ",
        "ازاي ابدا فري لانسر في مجال البرمجه": "تقدر تبدأ تقديم خدماتك على منصات العمل الحر زي أوب وورك وفريلانسر وتبدأ",
        "ابدا سايبر سكيورتي منين": "تقدر تبدأ بتعلم أساسيات الأمان السايبراني ومن ثم تتخصص في مجال معين زي التستنج ",
        "الفرق بين التعلم الآلي والذكاء الصناعي": "الذكاء الصناعي هو المجال اللي بيخلي الأنظمة تبدو ذكية، أما التعلم الآلي فهو نوع من التقنيات ضمن مجال الذكاء الصناعي",
        "ازاي استخدم الذكاء الاصطناعي في تطوير البرمجيات": "ممكن استخدمه في تحسين عمليات الأتمتة، وتحليل البيانات",
        "ما هي اهم التوجهات للبرمجه في المستقبل": "بعض التوجهات تشمل التطور نحو الحوسبة السحابية، والذكاء الاصطناعي، والواقع المعزز والواقع الافتراضي",
        "أَيه هو الـ كومبايلر ودوره فِي البرمجه": "الكومبايلر هو اللي بيحول الكود اللي كتبته إلى لغة الكمبيوتر علشان يفهمها وينفذها",
        "ازاي اطور مهارتي في البرمجه بسرعه": "يمكنك المشاركة في دورات تعليمية على الإنترنت، وحل التحديات البرمجية",
        "ازاي احمي بيانات المستخدمين في تطبيقي من الاختراقات": " يمكنك تطبيق مبادئ الأمان القياسية مثل تشفير البيانات، وتحديث أمان التطبيق بانتظام",
        "ما هي اهم مجالات البرمجه": " أَهُمَّ المُجَالَاتِ فِي الْبَرَمْجَةِ هِيَ تَطْوِيْرُ الْوِيْبِ، تَطْوِيْرُ تَطْبِيْقَاتِ الْجَوَّالِ، تَطْوِيْرُ الْأَلْعَابِ، تَطْوِيْرُ الذَّكَاءِ الْاِصْطِنَاعِيِّ، وَعُلُومُ الْبَيَانَاتِ",
        "ازاي احافظ علي امان البرمجيات الخاص بي": "يمكنك الحفاظ على أمان البرمجيات الخاصة بك من خلال تحديث البرامج بانتظام، واستخدام كلمات مرور قوية، وتطبيق مبادئ الأمان السيبراني",
        "ما هي الحوسبه السحابيه": "الحوسبة السحابية هي نموذج لتقديم الخدمات التقنية عبر الإنترنت، مما يسمح بالوصول إلى الموارد الحاسوبية مثل التخزين بطريقة مرنة وفعالة ",
        "ازاي اتحقق من كفاءه التطبيق": "يمكنك التحقق من كفاءة التطبيق عن طريق إجراء اختبارات وتحليل الأداء ومراجعات الأكواد",
        "ازاي أحصل علي فرص عمل في مجال البرمجه": "يمكنك الحصول على فرص عمل في مجال البرمجة من خلال البحث عن وظائف عبر الإنترنت، والمشاركة في منتديات ومجتمعات المطورين، وبناء شبكة علاقات احترافية",
        "كيف يمكنني تطوير مهاراتي في مجال البرمجه": "يمكنك تطوير مهاراتك في مجال البرمجة من خلال ممارسة البرمجة بانتظام، وحل المشاكل التحديثية، وتعلم تقنيات جديدة",
        "ما هي أَفضل الموارد لتعلم البرمجه": "تُقدم منصات الدراسة عبر الإنترنت مثل كورسيرا و دورات تعليمية متنوعة في البرمجة، بالإضافة إلى المواقع والكتب والمدونات التعليمية",
        "ما هي أَهم لغات البرمجه التي يجب أَن أَتعلمها": "تعتمد اللغات التي يجب أن تتعلمها على اهتماماتك وأهدافك، ولكن بعض اللغات الشائعة تشمل سي شارب وسي بلس بلس ودارت",
        "ازاي أَقوم بتطوير مهاراتي في تطوير تطبيقات الموبايل": "تقوي مهاراتك بتعلم لغات البرمجة المستخدمة في تطوير التطبيقات وتطبيقها عمليًا",
        "ما هي افضل الممارسات لاداره كلمات المرور بشكل امن": "تشمل أفضل الممارسات لإدارة كلمات المرور بشكل آمن استخدام كلمات مرور قوية وفترات تغيير منتظمة وتفعيل التحقق المزدوج",
        "ما هو مفهوم التصميم النظيف": "التصميم النظيف هو الكود الذي يكون قابلًا للقراءة والصيانة والتعديل بسهولة",
        "الفرق بين الشبكات العصبية الاصطناعيه والشبكات العصبيه الحيويه": "الشبكات العصبية الاصطناعية هي نماذج رياضية تاخذ فكرتها من الشبكات العصبية الحيوية، التي توجد في أجسام الكائنات الحية، لكنها تعمل بطريقة تقليدية في الحاسوب",
        "االداتا ستراكشر دوره إِيه وازاي بتأثر علي البرمجة": " يهمها تَنْظِيم الْبَيَّانَات فِي الْبَرْنَامَج وَتَحْسِين أَدَاءه ",
        " ازاي اعمل  ديباجنج لاخطاء في البرنامج": " تقْدِر تَسْتَخْدِم أَدَوَات مُتَخَصِّصَة فِي الْتَّصْحِيح  خَطْوَة بِخَطْوَة َتَحْلِل الْأَخْطَاء ",
        "اهميه الدوكيمنتشن فِي البرمجه إِيه": "هِيَهُمَّهَا وَصْف الْكُود وَتَوْثِيقه بِشَكْل مُنَظَّم عَلَّشْان يَسْهُل فَهْمه وَاِسْتِخْدَامه لِلْآخَرِين ",
        "دور الباك اند والفرونت اند": "الفرق بين الباك اند والفرونت اند هو أن الباك اند يتعامل مع الجانب الخادم من التطبيق، أي الجانب الذي يتعامل مع قاعدة البيانات والمنطق الأساسي للتطبيق، بينما يتعامل الفرونت اند مع  العميل، أي واجهة المستخدم",
        "ازاي أَختار أَسماء مناسبه للمتغيرات والدوال في البرمجه": "تَخْتَار أَسْمَاء تَعْبُر عَن وَظِيفَة الْمُتَغَيِّر أَو الدَّالَة بِشَكْل وَاضِح وَسَهْل الْفَهْم",
        "اهميه الفيرجن كونترول فِي البرمجه إِيه": "بِيسَاعِد فِي تَتَبُّع تَغْيِيرَات الْكُود وَإِدَارَتهَا بِشَكْل فَعَّال وَمُنَظَّم ",
        "مفهوم انترنت الاشياءايه": "إنترنت الأشياء هي تقنية تتيح للأجهزة المختلفة التواصل مع بعضها البعض ومشاركة البيانات عبر الإنترنت، مما يسهم في تحسين الاتصال وإدارة البيانات",
        "االفرق بين التعلم الآلي و الذكاء الصناعي ايه": "الذكاء الصناعي هو المجال العام الذي يهتم بجعل الأنظمة تبدو وكأنها ذكية، أي قادرة على التفكير واتخاذ القرارات بنفسه أما التعلم الآلي فهو نوع من التقنيات تندرج ضمن مجال الذكاء الصناعي، ويعتمد على استخدام البيانات",
        "اهميه التستنج فِي البرمجه اِيه": "بِيْسَاعِد فِي التَّأَكُّد مِن أَن الْبَرْنَامَج يَعْمَل بِشَكْل صَحِيح وَلَا يَحْتَوِي عَلَى أَخْطَاء"
        , "هل يوجد لدى ملهم العاب":"نعم بالطبع لدي العاب مثل Chess, X and O,and Snake"



    };

    if (basicResponses.containsKey(input)) {
      return basicResponses[input];
    } else {
      // If no predefined response, you can provide a default response or use more advanced logic
      return ' ';
    }
  }

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: Container(
        color:  Color(0xFF272431),
        child: Center(
          child: SingleChildScrollView(
            child: Column(
              mainAxisAlignment: MainAxisAlignment.center,
              children: [
              CircularImageWidget(
            image: AssetImage('asset/icons/wrobot.gif'),
            radius: 150.0,
                    ),
            SiriWaveform.ios7(
            
              options: IOS7SiriWaveformOptions(
            
                height:SizeApp.screenHeight(context)*.2,
                width: SizeApp.screenHeight(context)*.6,
              ),
            ),
            
                Text(_text,style: TextStyle(fontSize: 20,color: Colors.white,fontWeight: FontWeight.bold),),
                SizedBox(height: 20),
                ElevatedButton(
                  onPressed: isListening ? _stopListening : _listen,
                  child: Text(isListening ? 'Stop Listening' : 'Press to Speak'),
                ),
              ],
            ),
          ),
        ),
      ),
    );
  }
}
